# FailureDefinitionId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureDefinitionId Properties
FailureDefinitionId Class See Also
---
The FailureDefinitionId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Guid | The Guid of GUID-based enum object.  (Inherited from GuidEnum.) |

# See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace